/*
Целью включения комментариев в ваш код является объяснение, что делает ваша программа.
Java поддерживает и однострочные и многострочные комментарии.
Все символы, которые находятся внутри комментариев, игнорируются Java компилятором.

Однострочный коментарий начинается с двух косых черт(слешей) и продолжается до окончания строки.
Добавление комментариев при написании кода является хорошей практикой, потому что оно добавляет ясноть и понимание при возвращении для его редактирования, также как и для других программистов, желающих просмотреть ваш код.

Многострочные комментарии (блочные комментарии)
Java также поддерживает комментарии, которые занимают несколько строк. Такой комментарий начинается с символа косой черты, за которым следует символ звездочки, и закончивается символов звездоки, за которым следует символ косой черты.
Java не поддерживает вложенные многострочные комментарии. Однако, можно вложить однострочные внутри многострочных.

Комментарии документации это специальные комментарии, которые выглядят как многострочные, но отличаются тем, что они генерируют внешнюю документацию вашего исходного кода.
Они начинаются с символа /, за которым следует два символа **, и заканчивается символом *, за которым следует символ /.

Javadoc это инструмент, который включен в JDK и используется для генерации документации Java кода в HTML формате из исходного кода Java кода, которому необходима документация в предопределенном формате.
Если комментарий документации начинается более чем с двух символов *, то Javadoc предполагает, что вы хотели создать "блок" вокруг вашего комментария в исходном коде.
Дополнительные символы звездочки просто игнорируются.
*/



public class Comments {
}
