/*
Java это современный язык программирования высокого уровня, разработанный в первой половине 1990-х компанией Sun Microsystems, в последующей приобретенной компанией Oracle.
Java является Платформо-Независимым языком программирования, что значит, что вам необходимо написать программу один раз, чтобы запустить её на множестве различных платформ!
Java является переносимым, строго типизированным и данимическим языком программирования, с возможностью соответствия потребностям практически любого типа приложения.
Java гарантирует, что вы можете написать программу один раз, и запускать её на любых платформах.
Более 3 миллиардов устройств поддерживают Java.
Язык программирования Java ипользуется для разработки приложений под Google Android OS, различных Настольных Приложений, например медиа-плееров, антивирусных программ, Веб-приложений, Корпоративных Приложений (наприсер, в банковской сфере), и многое другое!
Изучайте, практикуйтесь и присоединяйтесь к огромному сообществу Java разработчиков по всему миру!
 */



public class IntroductionToJava {

}
